import React from "react";
import Navbar from "@/app/component/Navbar";
import GreenBlur from "@/app/component/GreenBlur";
import BackContent from "@/app/component/BackContent";
import Footer from "@/app/component/Footer";

export default function page() {
  const rule = [
    <div>
      <div>
        ตัวละครจะต้องมีสองร่างเนื่องจากจุดประสงค์ด้านการปกปิดตัวตน ได้แก่
        ร่างที่ใช้ในการแฝงตัวกับมนุษย์ปกติ และร่างฮีโร่ที่ใช้ในการออกทำภารกิจ
        ต่อสู้กับเหล่าวายร้าย
      </div>
      <ul className="list-disc pl-4">
        <li>
          ร่างที่ใช้แฝงร่วมกับมนุษย์ - ลักษณะภายนอกจะต้องเหมือนมนุษย์ทั่วไป สีผม
          สีผิว และสีตาของตัวละครสมควรเป็นสีธรรมชาติเพื่อความกลมกลืน
          แต่สามารถอ้างอิงว่าเป็นการย้อมผมหรือการผิดปกติจากโรคได้
        </li>
        <li>
          ร่างฮีโร่ - ร่างที่ใช้ออกทำภารกิจ
          สามารถใช้ร่างที่แท้จริงของตัวละครได้โดยไม่มีการจำกัดเผ่า
          ไม่จำเป็นจะต้องอยู่ในลักษณะของมนุษย์ อาทิ เอเลี่ยนร่างโปร่งแสง, มีปีก,
          มีสิบแขน, เป็นสัตว์
        </li>
      </ul>
    </div>,
    "หลีกเลี่ยงการสร้างตัวละครที่มีประวัติและเนื้อหาผิดศีลธรรมซึ่งอาจก่อให้เกิดความไม่สบายใจในโลกแห่งความเป็นจริง อาทิ การข่มขืน การสมสู่กับสัตว์ ความรักระหว่างสายเลือด คลั่งใคล้เด็ก เป็นต้น",
    "สามารสร้างตัวละครที่มีหูหรือหางสัตว์ได้จากการตัดต่อพันธุกรรมหรือการทดลอง และต้องมีความสามารถพิเศษเพื่อเข้าเรียนใน Apex Heroic Academy",
    "ไม่จำกัดรูปลักษณ์และลักษณะทางกายภาพที่แท้จริงของซุปเปอร์ฮีโร่ สามารถอยู่ในรูปแบบ สัตว์, เอเลี่ยน, อสูรกาย ฯลฯ ได้ แต่ตัวละครดังกล่าวต้องสามารถแปลงร่างเป็นมนุษย์ และสามารถแฝงตัวอยู่บนโลกได้",
    "สามารถสร้างเผ่าพันธุ์หรือสถานที่สมมุติได้ ไม่จำเป็นต้องมีอยู่จริง แต่จะต้องอยู่ในขอบเขตมิติที่กำหนดให้",
    "อนุญาตให้ลงตัวละครที่มาจากการอดีตหรือโลกอนาคตได้",
    "เนื่องจากแท็กเป็นธีมฮีโร่ การสร้างตัวละครที่อาจหลุดธีม อาทิ เป็นโรคจิตเวชรุนแรง หรือ ฆาตรกร อาจสุ่มเสี่ยงว่าจะผิดวัตถุประสงค์ของโรงเรียนและผู้สร้างได้ ขอให้หลีกเลี่ยงนะคะ ( สามารถลงตัวละครนิสัยแย่, วายร้ายกลับใจ, ความคิดบิดเบี้ยว ฯลฯ ได้ตามปกติ )",
    "อนุญาตให้สร้างตัวละครที่เป็น Superhero, ครูผู้ฝึกสอน, ชาวเมืองได้  ในส่วนของเหล่าร้ายสามารถงอกเพื่อเป็นซัพคาร์ได้ แต่จะไม่ถือว่าเป็นส่วนหนึ่งของแท็ก ( หาก #AHA_AU ได้รับกระแสตอบรับดี อาจมีพิจารณาโรงเรียนของตัวร้ายหลังจากนี้ )",
    "อนุญาตให้ลงได้แค่ Original Character เท่านั้น ห้ามดัดแปลง แอบอ้าง จากตัวละครที่มีอยู่แล้ว",
    "#AHA_AU เป็นจักรวาลที่ถูกคิดขึ้นมาใหม่เอง ดังนั้นไม่อนุญาตให้มีการสร้างตัวละครที่มีความเกี่ยวข้องกับการ์ตูน หรือสื่ออื่น ๆ ที่มีอยู่แล้วมาก่อน  อาทิ สไปเดอร์แมน, พาวเวอร์พัฟเกิร์ล, มาร์เวล",
    "ไม่จำกัดสัญชาติและเชื้อชาติของตัวละคร อย่างไรก็ตาม Setting และ ตัวโรงเรียนตั้งอยู่ที่ประเทศอเมริกา เผ่าพันธุ์และฮีโร่สมควรที่จะมีความสมเหตุสมผล และไม่หลุดคอนเซ็ปมากจนเกินไป",
    "พลังและขอบเขตความสามารถต้องอยู่ในความสมดุล ถึงจะเป็นแฟนตาซี แต่ขอความร่วมมือไม่มากจนกระทบกับ Setting โดยรวม อาทิ ดีดนิ้วแล้วลบหายทั้งจักรวาล",
    "พลังวิเศษจะต้องมาจากตัวของซุปเปอร์ฮีโร่เป็นหลักเองไม่ใช่การถืออาวุธ ( ยกเว้นอาวุธที่กลายเป็นส่วนหนึ่งของร่างกายไปแล้ว อาทิ นาฬิกา Ben10 และสามารถถืออาวุธที่คิดขึ้นเองได้ แต่โดยหลักแล้วตัวฮีโร่ต้องมีพลังในตัวของตัวเองอยู่แล้ว )",
    "นักเรียนต้องมีอายุระหว่าง 15-20 ปี ( ในลักษณะทางกายภาพภายนอก ในกรณีที่บางเผ่ามีอายุยืน )",
    "ชุดปฏิบัติหน้าที่ของเหล่าฮีโร่สามารถออกแบบได้ตามชอบ โรงเรียนไม่มีกำหนดให้",
    "เนื่องจากเป็นแท็คสาธารณะและมีเรทปลอดภัยสำหรับเยาวชน ขอความร่วมมือหลีกเลี่ยงการลงตัวละครที่เข้าข่ายล่อแหลมทั้งด้านเผ่าพันธุ์และพลังวิเศษในทางเพศ อาทิ อินคิวบัส, ซัคคิวบิส, พลังในการร่วมเพศ, อวัยวะเพศเหล็ก, หรือ ปล่อยพลังจากหัวนม",
    "อนุญาตให้มีสัตว์เลี้ยงหรือสัตว์ที่ร่วมต่อสู้ได้ ( Animal Sidekick ) ไม่จำเป็นต้องเป็นสิ่งมีชีวิตจากโลกมนุษย์ สามารถคิดและออกแบบเองได้ แต่ต้องมีขนาดเหมาะกับสถานที่ในโรงเรียนและยุคสมัย สัตว์ขนาดใหญ่เช่น ช้างแอฟริกาหรือไดโนเสาร์ ขอความร่วมมือไม่ให้ลงเพราะหลุด Setting",
  ];
  const thiscontent = (
    <div className="md:w-3/5 pl-4">
      <ol className="list-decimal text-xs font-thin">
        {rule.map((item) => (
          <li key={item} className="pb-2">
            {item}
          </li>
        ))}
      </ol>
    </div>
  );

  return (
    <main className="bg-secondary-400 text-white w-full relative overflow-hidden">
      <div className="absolute left-[-200px] top-[-200px] z-0">
        <GreenBlur />
      </div>
      <div className="absolute right-[-200px] top-[500px] z-0">
        <GreenBlur />
      </div>
      <Navbar />

      <BackContent
        label="เกณฑ์การสร้างตัวละคร"
        content={thiscontent}
        prev="/join"
      />
      <Footer />
    </main>
  );
}
