import React from "react";
import Maincourse from "./Maincourse";
import Timeline from "./Timeline";

export default function page() {
  const cardETC = [
    {
      label: "การสอบเลื่อนระดับขั้น",
      content:
        "ทุกเดือนจะมีการสอบวัดระดับเพื่อติดตามผลการของนักเรียนอย่างสม่ำเสมอ นั่นหมายความว่าระดับชนชั้นของฮีโร่สามารถขึ้นหรือลงได้ตลอดเวลาหากคะแนนของนักเรียนออกมาไม่เป็นที่น่าพอใจ",
    },
    {
      label: "การสอบเลื่อนระดับขั้น",
      content:
        "นักเรียนคนใดที่ไม่สามารถสอบผ่านได้จะต้องอยู่ระดับเดิม (เรียกว่าการซ้ำชั้น) และหากนักเรียนคนใดที่มีการซ้ำชั้นมามากกว่า 5 ครั้งขึ้นไปจะล่วงลงมาระดับ F โดยอัตโนมัติ … แน่นอนว่าคนกลุ่มนี้สามารถเลื่อนระดับได้เสมอ แต่ต้องพยายามมากกว่าคนอื่นหน่อย",
    },
    {
      label: "บุคลากรในโรงเรียน",
      content:
        "บุคลากรในโรงเรียนส่วนใหญ่เป็นหุ่นยนต์หรือปัญญาประดิษฐ์ ตั้งแต่ตำแหน่งคนสวน, แม่บ้าน หรือคนทำความสะอาด พวกมันก็ยังสามารถทำหน้าที่สอนหนังสือได้เช่นเดียวกับมนุษย์และผู้มีพลังวิเศษที่เป็นคุณครูในโรงเรียน ",
    },
  ];
  const cardLevel = [
    {
      level: "SS",
      content: (
        <div className="mt-8">
          ฮีโร่ผู้สามารถบรรลุพลังของตัวเองอย่างแตกฉาน
          ถือว่าเป็นนักเรียนกลุ่มที่ทรงพลังและน่าเคารพที่สุดในโรงเรียน
          ฮีโร่ระดับนี้มักได้รับมอบหมายภารกิจที่เหนือความคาดหมาย ท้าทาย
          และเสี่ยงอันตรายจากภัยคุกคามโลกมากที่สุด <br />
          <br />
          เงื่อนไขในการเป็นฮีโร่ระดับสูงสุด
          <ul className="list-disc ml-4">
            <li>ตัวละครจะต้องสอบผ่านทุกวิชาทั้งทฤษฎีและปฏิบัติ </li>
            <li>มีคะแนนสูงเป็นลำดับต้น ๆ ของรุ่น </li>
            <li>มีผลงานการช่วยโลกมาไม่ต่ำกว่าสามร้อยครั้ง </li>
          </ul>
        </div>
      ),
    },
    {
      level: "S",
      content: (
        <div className="mt-8">
          แม้จะอยู่รองลงมาเป็นอันดับสอง
          แต่ไม่ได้หมายความว่านักเรียนที่อยู่ในระดับ S จะมีความสามารถด้อยกว่า
          กลุ่มฮีโร่ระดับ S สามารถบรรลุความสามารถและพลังของตัวเองได้อย่างแตกฉาน
          พวกเขาได้รับการเคารพและนับถือในฐานะผู้นำที่ดี
          แต่มีข้อเสียคือเป็นระดับที่มีการแข่งขันสูง
          บ่อยครั้งที่ถูกส่งตัวไปช่วยโลกในภารกิจเสี่ยงอันตราย
          ในกรณีที่ฮีโร่ระดับ SS ติดภารกิจอื่นหรือไม่ว่าง
        </div>
      ),
    },
    {
      level: "A",
      content: (
        <div className="mt-8">
          ฮีโร่ในระดับA มีความสามารถและชั่วโมงการบินสูงกว่าสามลำดับที่เหลือ
          มีความสามารถในการค้นพบพลังของตัวเองครบถ้วน แต่ยังคงต้องหมั่นฝึกฝนเสมอ
          นักเรียนกลุ่มนี้สามารถใช้พลังของตัวเองได้อย่างยอดเยี่ยม
          และพร้อมที่จะไต่ลำดับตัวเองขึ้นตลอดเวลา
        </div>
      ),
    },
    {
      level: "B",
      content: (
        <div className="mt-8">
          ฮีโร่ระดับ B คือกลุ่มนักเรียนที่มีจำนวนมากที่สุดในโรงเรียน ทะเยอทะยาน
          แต่ยังขาดประสบการณ์และทักษะ พวกเขาไม่ใช่จุดด้อย
          แต่ยังต้องการการพัฒนาความสามารถและพลังของตัวเองเป็นอย่างหนัก
          ส่วนมากจะยังค้นพบพลังของตัวเองไม่ครบถ้วน ไร้การควบคุม
          หรือมีจุดอ่อนที่ถูกกำจัดได้ง่ายอยู่
        </div>
      ),
    },
    {
      level: "C",
      content: (
        <div className="mt-8">
          ฮีโร่ระดับ C คือฮีโร่รองโหล่ ไม่ถึงกับบ๊วย
          แต่นักเรียนเหล่านี้ยังต้องฝึกอีกเยอะ พวกเขามีพลังและพรสวรรค์
          แต่แทบไม่รู้วิธีการใช้มันเลย
          คะแนนสอบออกมาไม่เป็นที่น่าพอใจทั้งทฤษฎีและปฏิบัติ
          บ่อยครั้งที่ทำภารกิจในการช่วยโลกล้มเหลวบ่อย ๆ
        </div>
      ),
    },
    {
      level: "F",
      content: (
        <div className="mt-8">
          ฮีโร่ระดับ F คือกลุ่มคนที่ไม่สามารถควบคุมพลังของตัวเองได้
          หรือแทบมองไม่เห็นความเป็นยอดมนุษย์อยู่ในตัวพวกเขา
          นักเรียนเหล่านี้มักอยู่ในฐานะผู้ติดตามหรือตัวประกอบเวลากู้โลก
          เพราะแทบไม่เคยได้รับความเชื่อใจให้ฉายเดี่ยวในภารกิจเลย
        </div>
      ),
    },
  ];

  const semesterInfo = [
    {
      label: "ระบบการเรียน",
      sub_label: "",
      content: `AHA ใข้เวลา 3 ปีในการจบการศึกษาจากสถาบัน โดยในปีการศึกษาแรกนักเรียนทุกคนจะได้รับการสอบวัดระดับเพื่อจัดสรรให้นักเรียนได้อยู่ในระดับที่เหมาะสมกับตนเอง หลักจากนั้นจัดการเรียนเป็นปีละ 3 ภาคการศึกษา และจัดสอบวัดระดับทุกสิ้นเทอม นั่นหมายความว่าระดับชั้นของฮีโร่สามารถขึ้นหรือลงได้ตลอดเวลาหากคะแนนของนักเรียนออกมาไม่เป็นที่น่าพอใจ`,
    },
    {
      label: "การเลื่อนระดับขึ้น",
      sub_label: "สอบผ่าน",
      content: (
        <div className="grid gap-4">
          <div>
            การเลื่อนแรงค์จำเป็นต้องให้ฮีโร่สอบผ่านทุกวิชาตั้งแต่ทฤษฎีรวมถึงปฏิบัติ
            ภาพรวมนับว่าดีจนไปถึงพอไปวัดไปวาได้ เกรดการให้คะแนนมีตั้งแต่ A+
            ไปจนถึง F โดยครูผู้สอนมีอำนาจในการกำหนดเกณฑ์ในรายวิชาที่ตนเองสอน
          </div>
          <div>
            <span className="font-semibold">หมายเหตุ</span> : ผู้ที่ถึงระดับ SS
            หรือ S ก่อนก็ต้องรักษาผลการเรียนในเทอมต่อ ๆ ไป ไม่ให้ตกลงมา
          </div>
        </div>
      ),
    },
    {
      label: "การซ้ำชั้น",
      sub_label: "สอบตก 1 ครั้ง",
      content: (
        <div>
          สถาบันแห่งนี้ไม่มีคำว่าให้โอกาส
          ทุกชีวิตและชะตากรรมอยู่ในการดูแลของเหล่าฮีโร่
          หากพวกคุณพลาดขึ้นมานั่นอาจหมายถึงการล่มสลายของมนุษยชาติ
          แม้คุณจะตกเพียงหนึ่งวิชา หรือขาดคะแนนแค่ 1
          นั่นก็ถือว่าคุณไม่ผ่านหลักสูตรการเลื่อนลำดับขั้นแล้ว
          จำเป็นต้องอยู่แรงค์เดิมและเรียนรายวิชาใหม่ทั้งหมด
        </div>
      ),
    },
    {
      label: "การลดระดับลง",
      sub_label: "สอบตก 2 ครั้ง",
      content: (<div className="grid gap-4">
      <div>
        เลวร้ายที่สุด !
        เรียนประสาอะไรให้สอบตกสองครั้งติดแบบนี้จะไปช่วยอะไรใครได้
      </div>
      <div>
        ฮีโร่ที่สอบตกสองครั้งติดจะต้องถูกลดลำดับขั้นลงเรื่อยๆ จนไปถึงขั้น F
        และกลายเป็นพวกโหลยโท่ยที่มีพลังแต่ใช้ไม่เป็นจนถึงขั้นสอบตกมาอยู่กับพวกแรงค์อ่อนพวกนี้
      </div>
      <div>
        <span className="font-semibold">หมายเหตุ</span> :
        ในกรณีที่มีการสอบตกครั้งต่อไปหลังจากแรงค์ลดแล้ว จะนับว่าเป็นครั้งที่
        1 ใหม่ ดังนั้นจึงให้เริ่มนับใหม่หลังจากรีแรงค์
      </div>
    </div>),
    },
  ];

  const content = (
    <div className="mb-24 md:mb-0">
      <div className="flex flex-col gap-4">
        <div className="text-xl font-semibold tracking-wide">About</div>
        <hr />
        <div className="flex flex-col gap-4 text-sm font-light">
          <div>
            Apex Heroic Academy ก่อตั้งในปี 2096
            สร้างขึ้นในรูปแบบโมเดิร์นทันสมัน
            มีสิ่งอำนวยความสะดวกสบายให้กับบรรดานักเรียนและครูผู้สอนด้วยเทคโนโลยี
            บริการและอุปกรณ์ทางวิทยาศาสตร์ที่จำเป็นต่อฮีโร่แต่ละกลุ่ม
          </div>
          <div>
            ระบบการศึกษาของพวกฮีโร่ก็ไม่ต่างอะไรกับนักเรียนปกติ
            พวกเขาเรียนหนังสือ มีการสอบ และทำงานกลุ่มร่วมกับคนอื่น
            โดยจะมีการแบ่งระดับชั้นตามความเก่งและความแข็งแกร่ง ไม่ใช่อายุ
            ดังนั้นแล้วฮีโร่คนใดที่สอบไม่ผ่าน
            ไม่สามารถไต่ระดับมาตรฐานที่โรงเรียนกำหนดไม่ได้ จะถือว่าเป็น
            ‘ฮีโร่สอบตก’ ต้องซ้ำชั้นไปเรื่อย ๆ จนกว่าจะสอบผ่าน
          </div>
          <div>
            คำขวัญโรงเรียน : "With Great Power Comes Great Responsibility”
            <br />
            <br />
            พลังอันยิ่งใหญ่มาพร้อมกับความรับผิดชอบอันยิ่งใหญ่
          </div>
          <div></div>
        </div>
      </div>

      <div className="flex flex-col gap-4 mt-36">
        <div className="text-xl font-semibold tracking-wide">Level</div>
        <hr />

        <div className="grid md:grid-cols-2 lg:grid-cols-3 md:gap-16 gap-24 mt-12 text-sm font-light">
          {cardLevel.map(({ level, content }) => (
            <div key={level}>
              <div className="w-16 h-16 m-auto flex border border-primary rounded-full text-lg font-normal">
                <div className="w-fit m-auto">{level}</div>
              </div>
              {content}
            </div>
          ))}
        </div>
      </div>
{/* 
      <div className="flex flex-col gap-4 mt-36">
        <div className="text-xl font-semibold tracking-wide">ETC</div>
        <hr />
        <div className="grid md:grid-cols-2 lg:grid-cols-3 md:gap-16 gap-24 mt-12 text-sm font-light">
          {cardETC.map(({ label, content }) => (
            <div key={label}>
              <div className="font-semibold w-fit border-b border-primary mb-4">
                {label}
              </div>
              {content}
            </div>
          ))}
        </div>
      </div> */}

      <div className="flex flex-col gap-20 mt-36">
        <div className="text-xl font-semibold tracking-wide border-b border-primary w-fit mx-auto">
          Semester
        </div>
        <Timeline/>
        <div className="grid md:grid-cols-2 md:gap-16 gap-24 mt-12 text-sm font-light">
          {semesterInfo.map(({ label, sub_label, content }) => (
            <div key={label}>
              <div className="border-b border-primary pb-2 mb-4 grid grid-cols-2">
                <div className="font-semibold">{label}</div>
                <div className="justify-self-end text-faded">{sub_label}</div>  
              </div>
              {content}
            </div>
          ))}
        </div>
      </div>

    </div>
  );

  return (
    <>
      <Maincourse content={content} />
    </>
  );
}
